Repository: TechforgoodCAST/first-days
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: cy

source: Before your volunteer starts you'll probably want to send them information so that they can settle in quickly.
cy: Cyn i'ch gwirfoddolwr ddechrau, mae'n debyg y byddwch am anfon gwybodaeth ato er mwyn iddo allu ymgartrefu'n gyflym.

source: Charity number:
cy: Rhif elusen:

source: Confirm new password
cy: Cadarnhewch y cyfrinair newydd

source: December
cy: Rhagfyr

source: Details of the role
cy: Manylion y rôl

source: Doing this you could gain
cy: Trwy wneud hyn, gallech gael

source: Dress code
cy: Cod gwisg

source: February
cy: Chwefror

source: Finance
cy: Cyllid

source: Forgot your password?
cy: Wedi anghofio'ch cyfrinair?

source: HR
cy: Adnoddau Dynol

source: Hopefully your volunteer is due to start in the next 2 weeks or so. It's helpful to send them a reminder email, together with useful information.
cy: Gobeithio y bydd eich gwirfoddolwr yn dechrau yn ystod y pythefnos nesaf. Mae'n ddefnyddiol anfon neges e-bost atgoffa ato, ynghyd â gwybodaeth ddefnyddiol.

source: How frequently will the volunteer be needed to work? (for example, once a week, once a month, quarterly board meetings etc)
cy: Pa mor aml y bydd yn ofynnol i'r gwirfoddolwr weithio? (Er enghraifft, unwaith yr wythnos, unwaith y mis, cyfarfodydd bwrdd chwarterol, ac ati)

source: How will this work help the organisation? (1 sentence, jargon free)
cy: Sut y bydd y gwaith hwn yn helpu'r sefydliad? (Un frawddeg, heb jargon)

source: IT
cy: TG

source: In a few sentences, what does your organisation do?
cy: Nodwch, mewn ychydig frawddegau, yr hyn y mae eich sefydliad yn ei wneud?

source: Is there any other info you'd like to add?
cy: A oes yna unrhyw wybodaeth arall yr hoffech ei hychwanegu?

source: It will be based in
cy: Bydd y rôl wedi'i lleoli yn

source: It's important that your volunteer is prepared for their first day and has completed or sent through any paperwork they need to fill out for the role.
cy: Mae'n bwysig bod eich gwirfoddolwr yn barod ar gyfer ei ddiwrnod cyntaf, a'i fod wedi llenwi neu ddychwelyd unrhyw waith papur y mae angen iddo ei lenwi ar gyfer y rôl.

source: It's important your volunteer is prepared for their first day. It can be intimidating to start in a new organisation, so help them to prepare by filling out the details below.
cy: Mae'n bwysig bod eich gwirfoddolwr yn barod ar gyfer ei ddiwrnod cyntaf. Gall y syniad o ddechrau mewn sefydliad newydd godi ofn, felly helpwch y gwirfoddolwr i baratoi trwy lenwi'r manylion isod.

source: January
cy: Ionawr

source: July
cy: Gorffennaf

source: June
cy: Mehefin

source: Legal
cy: Cyfreithiol

source: Let's find a volunteer
cy: Dod o hyd i wirfoddolwr

source: March
cy: Mawrth

source: May
cy: Gall

source: New password
cy: Y cyfrinair newydd

source: November
cy: Tachwedd

source: October
cy: Hydref

source: Other things helpful to know
cy: Pethau eraill y gallai fod yn ddefnyddiol i chi eu gwybod

source: Please confirm your charity number/company number (if applicable)
cy: Cadarnhewch eich rhif elusen/rhif y cwmni (os yw'n berthnasol)

source: Please enter a new password for your account.
cy: Teipiwch gyfrinair newydd ar gyfer eich cyfrif.

source: Please give a one sentence description of the role
cy: Rhowch ddisgrifiad o'r rôl, mewn brawddeg

source: Preparation Email
cy: Neges E-bost Paratoi

source: Preparing the volunteer for their first day
cy: Paratoi'r gwirfoddolwr ar gyfer ei ddiwrnod cyntaf

source: Reset password
cy: Ailosod y cyfrinair

source: Role
cy: Rôl

source: Send reset link
cy: Anfon dolen i ailosod y cyfrinair

source: September
cy: Medi

source: Start date preparation
cy: Paratoi ar gyfer y dyddiad dechrau

source: Thanks for answering the questions for the preparation email.
cy: Diolch am ateb y cwestiynau ar gyfer y neges e-bost paratoi.

source: Thanks very much for telling us about the role.
cy: Diolch yn fawr am ddweud wrthym am y rôl.

source: The impact for us
cy: Yr effaith arnom ni

source: The role is needed for
cy: Mae angen y rôl ar gyfer

source: The text for your role description is here on the left. Please copy it into a new document so that you can edit it as you see fit, then share it with your network. You can also email it to yourself.
cy: Mae'r testun ar gyfer eich rôl-ddisgrifiad yma ar y chwith. Copïwch y templed i ddogfen newydd fel y gallwch ei olygu yn ôl yr angen, ac yna ewch ati i'w rannu â'ch rhwydwaith. Gallwch hefyd ei anfon atoch chi eich hun trwy e-bost.

source: This form will help you understand what your organisation needs from a volunteer by guiding you through all the steps in creating a great volunteer role description.
cy: Bydd y ffurflen hon yn eich helpu i ddeall yr hyn y mae ar eich sefydliad ei angen gan wirfoddolwr, a hynny trwy eich arwain, fesul cam, i greu disgrifiad gwych o'r rôl wirfoddol.

source: View Email Template
cy: Gweld y Templed E-bost

source: View Role Description Template
cy: Gweld y Templed Disgrifiad Rôl

source: Want to speak further? Contact
cy: Hoffech chi drafod ymhellach? Cysylltwch â

source: We are looking for an individual with skills in
cy: Rydym yn chwilio am unigolyn sy'n meddu ar sgiliau

source: We hope you're looking forward to your first day with us on the
cy: Gobeithio eich bod yn edrych ymlaen at eich diwrnod cyntaf gyda ni ar

source: We look forward to seeing you then,
cy: Edrychwn ymlaen at eich gweld bryd hynny,

source: We wanted to offer some helpful information.
cy: Roeddem am gynnig rhywfaint o wybodaeth ddefnyddiol.

source: Website:
cy: Gwefan:

source: What are the contact details if a potential volunteer wants to speak further?
cy: Beth yw'r manylion cyswllt pe bai gwirfoddolwr posibl am drafod ymhellach?

source: What are the specific skills you require?
cy: Pa sgiliau penodol yr ydych yn gofyn amdanynt?

source: What is the name of your organisation?
cy: Beth yw enw eich sefydliad?

source: What is the role title?
cy: Beth yw teitl y rôl?

source: What is the total length of the opportunity? (e.g. 1 month, 6 months, 1 year, ongoing)
cy: Beth yw cyfanswm hyd y cyfle? (Er enghraifft, un mis, chwe mis, un flwyddyn, parhaus)

source: What notable achievements has your organisation had? e.g. awards, membership of professional bodies (this can help attract volunteers to your organisation)
cy: Pa lwyddiannau nodedig y mae eich sefydliad wedi'u cael? Er enghraifft, gwobrau, aelodaeth o gyrff proffesiynol (gallai hyn fod o gymorth wrth ddenu gwirfoddolwyr at eich sefydliad)

source: What skill area is the volunteer role in?
cy: Pa faes sgiliau y mae'r rôl yn perthyn iddo?

source: What skills or experience will the volunteer gain from doing this role?
cy: Pa sgiliau neu brofiadau y bydd y gwirfoddolwr yn eu hennill wrth gyflawni'r rôl hon?

source: What we do
cy: Yr hyn a wnawn

source: What will be the nature of the work that they will be undertaking? (For example, will they meet the team? Have a tour? What will they likely be working on?)
cy: Beth fydd natur y gwaith y bydd yn ei wneud? (Er enghraifft, a fydd yn cwrdd â'r tîm? Yn cael taith dywys? Ar beth y bydd yn debygol o fod yn gweithio?)

source: What you'll be doing on your first day
cy: Yr hyn y byddwch yn ei wneud ar eich diwrnod cyntaf

source: What you'll gain
cy: Yr hyn y byddwch yn elwa arno

source: When is the volunteer's first day? (if you don't know, please provide us with your best guess)
cy: Pa ddiwrnod fydd diwrnod cyntaf y gwirfoddolwr? (os nad ydych yn gwybod, rhowch eich amcan gorau)

source: When you've selected the appropriate person, simply sign back on and we'll take you through the remaining steps of the process!
cy: Pan fyddwch wedi dewis yr unigolyn priodol, mewngofnodwch eto, a byddwn yn eich tywys trwy'r camau sy'n weddill o'r broses!

source: Where will the volunteer be based? (in a certain office location, working from home?)
cy: Ble fydd y gwirfoddolwr wedi'i leoli? (Mewn lleoliad swyddfa penodol, neu'n gweithio o gartref?)

source: Your email text to send to the volunteer is here on the left. Please copy it into a new document so that you can edit it as you see fit. You can also email it to yourself.
cy: Mae'r testun ar gyfer y neges e-bost sydd i'w hanfon at y gwirfoddolwr yma ar y chwith. Copïwch y testun i ddogfen newydd, er mwyn i chi allu ei olygu fel y gwelwch yn dda. Gallwch hefyd ei anfon atoch eich hun trwy e-bost.

source: and a link to your website (if you have one)
cy: ac ychwanegwch ddolen i'ch gwefan (os oes un gennych)

source: A really focused and engaging role description is key to attracting the right volunteer to take your organisation to the next level, so it is important that you make a clear ask of what skills and experiences you require, and also show what is really great about your organisations and what the volunteer would gain from volunteering with you.
cy: Mae disgrifiad diddorol o'r rôl, ac iddo ffocws pendant, yn allweddol i ddenu'r gwirfoddolwr iawn i fynd â'ch sefydliad i'r lefel nesaf. Felly mae'n bwysig eich bod yn nodi'n glir y sgiliau a'r profiadau sy'n ofynnol, yn ogystal ag amlygu'r hyn sy'n wirioneddol wych am eich sefydliad a'r hyn y byddai'r gwirfoddolwr yn elwa arno pe byddai'n gwirfoddoli gyda chi.

source: A volunteer agreement helps both the organisation and its volunteers by making expectations clear. They also address the unlikely possibility of volunteers being considered employees in the eyes of the law.
cy: Mae cytundeb gwirfoddolwr yn helpu'r sefydliad a'i wirfoddolwyr trwy bennu'r disgwyliadau yn glir. Maent hefyd yn mynd i'r afael â'r posibilrwydd annhebygol y caiff gwirfoddolwyr eu hystyried yn weithwyr yn ôl y gyfraith.

source: Back
cy: Yn ôl

source: Before your volunteer can start, it is likely that they will need to provide certain paperwork. Here is a template of the documents that you have indicated that your organisation will require. It is important that both the volunteer and the host organisation are clear in understanding these requirements and that everyone is clear about the requirements in respect of paperwork needed before they commence the role. Good communication between the volunteer and host organisation is key to establishing a positive and professional relationship between all parties.
cy: Cyn y gall eich gwirfoddolwr ddechrau, mae'n debyg y bydd angen iddo ddarparu gwaith papur penodol. Dyma dempled ar gyfer y dogfennau y nodwyd gennych y bydd ar eich sefydliad eu hangen. Mae'n bwysig bod y gwirfoddolwr a'r sefydliad lletyol yn deall y gofynion hyn yn glir, a bod pawb hefyd yn glir ynghylch y gofynion o ran y gwaith papur sy'n ofynnol cyn i'r gwirfoddolwr ddechrau'r rôl. Mae cyfathrebu da rhwng y gwirfoddolwr a'r sefydliad lletyol yn allweddol i feithrin perthynas gadarnhaol a phroffesiynol rhwng pawb dan sylw.

source: Before your volunteer starts you’ll want to send them information so that they know what to expect and can settle in quickly. It is important that your volunteer is prepared for their first day and has completed any necessary paperwork. Volunteers will feel more supported and valued if they are communicated with fully in the time between them expressing an interest in your organisation and actually commencing volunteering with you.
cy: Cyn i'ch gwirfoddolwr ddechrau, byddwch am anfon gwybodaeth ato fel ei fod yn gwybod beth i'w ddisgwyl ac yn gallu ymgartrefu'n gyflym. Mae'n bwysig bod eich gwirfoddolwr yn barod ar gyfer ei ddiwrnod cyntaf, a'i fod wedi llenwi unrhyw waith papur angenrheidiol. Bydd gwirfoddolwyr yn teimlo eu bod yn cael eu cefnogi a'u gwerthfawrogi'n fwy os byddwch yn cyfathrebu'n llawn â nhw rhwng yr adeg yr oeddent wedi mynegi diddordeb a'r adeg y byddant yn dechrau gwirfoddoli gyda chi mewn gwirionedd.

source: Congratulations, you have successfully registered for First Days. We will guide you through the process of recruiting your volunteers, from assessing your needs through to getting feedback from your volunteer once they have commenced volunteering.
cy: Llongyfarchiadau, rydych wedi cofrestru'n llwyddiannus ar gyfer Diwrnodau Cyntaf. Byddwn yn eich tywys trwy'r broses o recriwtio eich gwirfoddolwyr, a hynny bob cam o'r ffordd o asesu eich anghenion, i gael adborth gan eich gwirfoddolwyr ar ôl iddynt ddechrau gwirfoddoli.

source: Did you enjoy your first day?
cy: A wnaethoch chi fwynhau eich diwrnod cyntaf?

source: Did you get introduced to colleagues?
cy: A gawsoch eich cyflwyno i gyd-weithwyr?

source: Do you have everything you need to do your role? e.g. information, equipment or resources
cy: A oes gennych bopeth y mae arnoch ei angen i gyflawni eich rôl? Er enghraifft, gwybodaeth, offer neu adnoddau

source: Enter your Email and Password below
cy: Teipiwch eich Cyfeiriad E-bost a'ch Cyfrinair isod

source: First Days has been created through funding provided by Big Lottery Fund Wales. The project is a partnership between Wales Co-operative Centre, Business in the Community Cymru, CAST and WCVA. Further information about the work of these organisations can be found here:
cy: Crëwyd Diwrnodau Cyntaf trwy arian gan Gronfa Loteri Fawr Cymru. Mae'r prosiect yn bartneriaeth rhwng Canolfan Cydweithredol Cymru, Busnes yn y Gymuned Cymru, CAST a Chyngor Gweithredu Gwirfoddol Cymru. Gallwch gael rhagor o wybodaeth am waith y sefydliadau hyn yma:

source: First Days has been made possible by funding received from the Big Lottery Fund. It is a partnership between Wales Co-operative Centre, Business in the Community, Wales Council for Voluntary Action and CAST.
cy: Gwnaed Diwrnodau Cyntaf yn bosibl trwy gyllid gan y Gronfa Loteri Fawr. Mae'n bartneriaeth rhwng Canolfan Cydweithredol Cymru, Busnes yn y Gymuned Cymru, Cyngor Gweithredu Gwirfoddol Cymru a CAST.

source: Good luck finding the right candidate.
cy: Pob lwc wrth geisio dod o hyd i'r ymgeisydd iawn.

source: Great! You are now signed up to First Days
cy: Gwych! Rydych 'nawr wedi cofrestru ar gyfer Diwrnodau Cyntaf

source: Hello
cy: Helô

source: Here is a confirmation agreement template that you can use to ensure that there is a clear understanding of what is expected from the volunteer and also from you as the host organisation. An important part of this understanding and communication can be putting in a place a volunteering agreement. This is particularly important when a private sector individual is engaging with the voluntary sector for the first time. It’s quite common for there to be differences in working culture that may surprise the volunteer.
cy: Dyma dempled ar gyfer cytundeb gwirfoddolwr y gallwch ei ddefnyddio i sicrhau bod yna ddealltwriaeth glir o'r hyn a ddisgwylir gan y gwirfoddolwr, yn ogystal â gennych chi fel y sefydliad lletyol. Gall rhoi cytundeb gwirfoddolwr ar waith fod yn rhan bwysig o'r ddealltwriaeth hon. Mae hyn yn arbennig o bwysig pan fydd unigolyn o'r sector preifat yn gweithio gyda'r sector gwirfoddol am y tro cyntaf. Mae gwahaniaethau o ran y diwylliant gweithio yn eithaf cyffredin, a gallai hyn beri syndod i'r gwirfoddolwr.

source: Here is the role description template that has been created based on the answers that you have provided. The specific answers that you have given helps you to really understand what your organisation needs from a volunteer by guiding you through all the steps in creating a great volunteer role description.
cy: Dyma dempled y rôl-ddisgrifiad, sy'n seiliedig ar yr atebion yr ydych wedi'u rhoi. Mae'r atebion penodol yr ydych wedi'u rhoi yn eich helpu i ddeall yn iawn yr hyn y mae ar eich sefydliad ei angen gan wirfoddolwr, a hynny trwy eich tywys trwy'r holl gamau wrth i chi greu disgrifiad gwych o rôl wirfoddol.

source: Here is the template of an e-mail that can be sent to your volunteers to get feedback from them about their volunteer experience with your organisation. It is important to get feedback from volunteers after their first day. Not only does it help you understand their experience, but also it helps identify ways you can improve your volunteer recruitment, retention and induction processes.
cy: Dyma'r templed ar gyfer neges e-bost y gellir ei hanfon at eich gwirfoddolwyr i gael adborth ganddynt am eu profiad fel gwirfoddolwyr gyda'ch sefydliad. Mae'n bwysig cael adborth gan wirfoddolwyr ar ôl eu diwrnod cyntaf. Nid yn unig y mae hyn yn eich helpu i ddeall eu profiadau, ond mae hefyd yn helpu i nodi'r ffyrdd y gallwch wella eich prosesau ar gyfer recriwtio, cadw ac ymsefydlu gwirfoddolwyr.

source: Here is the template of the volunteer first day preparation e-mail.
cy: Dyma dempled y neges e-bost paratoi ar gyfer diwrnod cyntaf y gwirfoddolwr.

source: How clear do you feel about your role?
cy: Pa mor eglur yr ydych yn teimlo ynghylch eich rôl?

source: How welcome did you feel, on a scale of 1-10 (1 being not welcome, 10 being like family)?
cy: Faint o groeso a gawsoch, ar raddfa o 1-10? (1 – yn teimlo na chawsoch ddim croeso, 10 – yn teimlo'n rhan o'r teulu)?

source: How well do you feel you understand what the organisation does and who it works with?
cy: Pa mor dda, yn eich barn chi, yr ydych yn deall gwaith y sefydliad, a phwy y mae'n gweithio gyda nhw?

source: Kind Regards,
cy: Cofion cynnes,

source: Name
cy: Enw

source: Once you have edited this template as required, please send to the volunteer. You can then sign back into First days, and we will take you through the final step of the process!
cy: Pan fyddwch wedi golygu'r templed hwn yn ôl yr angen, anfonwch ef at y gwirfoddolwr. Yna, gallwch ailfewngofnodi i'ch cyfrif Diwrnodau Cyntaf, a byddwn yn eich tywys trwy'r camau sy'n weddill o'r broses!

source: Once you have edited this template as required, please send to the volunteer. You can then sign back into first Days, and we will take you through the remaining steps of the process!
cy: Pan fyddwch wedi golygu'r templed hwn yn ôl yr angen, anfonwch ef at y gwirfoddolwr. Yna, gallwch ailfewngofnodi i'ch cyfrif Diwrnodau Cyntaf, a byddwn yn eich tywys trwy'r camau sy'n weddill o'r broses!

source: Once you have selected an appropriate person, you can sign back into First Days, and we will take you through the remaining steps of the process!
cy: Pan fyddwch wedi dewis yr unigolyn priodol, gallwch ailfewngofnodi i'ch cyfrif Diwrnodau Cyntaf, a byddwn yn eich tywys trwy'r camau sy'n weddill o'r broses!

source: Please study the role description and edit to ensure it captures exactly the information you want to give to a potential volunteer.
cy: Ewch ati i ddarllen a golygu'r rôl-ddisgrifiad, er mwyn sicrhau ei fod yn nodi yn union yr wybodaeth yr ydych am ei rhoi i ddarpar wirfoddolwr.

source: Remember that support is always available from local and national support organisations. The following link would be a good place to start in identifying local support and resources.
cy: Cofiwch fod yna gymorth bob amser ar gael gan sefydliadau cymorth lleol a chenedlaethol. Byddai'r ddolen ganlynol yn lle da i ddechrau wrth geisio dod o hyd i gymorth ac adnoddau lleol.

source: Role Description (please edit as you see fit)
cy: Rôl-ddisgrifiad (golygwch fel y gwelwch yn dda)

source: Something went wrong, please try again
cy: Aeth rhywbeth o'i le, felly rhowch gynnig arall arni.

source: The agreement template can be personalised and sent to the potential volunteer as part of the induction process. Please also see the following links that may be helpful to you and also your potential volunteer.
cy: Gellir personoli'r templed a'i anfon at y darpar wirfoddolwr yn rhan o'r broses ymsefydlu. Gweler hefyd y dolenni canlynol a allai fod o gymorth i chi a'ch darpar wirfoddolwr.

source: There are many sources of support to ensure that your volunteering opportunity is the best it can be. The following link would be good place to start:
cy: Mae yna lawer o ffynonellau cymorth ar gael i sicrhau bod eich cyfle gwirfoddoli y gorau y gall fod. Byddai'r ddolen ganlynol yn lle da i ddechrau:

source: Want to speak further? Contact
cy: Hoffech chi drafod ymhellach? Cysylltwch â

source: We hope you're looking forward to your first day with us on the
cy: Gobeithio eich bod yn edrych ymlaen at eich diwrnod cyntaf gyda ni ar

source: What else would be useful to know?
cy: Beth arall a fyddai'n ddefnyddiol i'w wybod?

source: What would have helped to make you feel more welcome?
cy: Beth allai fod wedi helpu i wneud i chi deimlo'n fwy cartrefol?

source: What would help to make you more clear about your role?
cy: Beth a allai helpu i'ch gwneud yn fwy eglur ynghylch eich rôl?

source: Would you like to volunteer with us again?
cy: A hoffech wirfoddoli gyda ni eto?

source: Would you recommend our organisation to your friends and family?
cy: A fyddech yn argymell ein sefydliad i'ch ffrindiau a'ch teulu?

source: You have now completed the First Days process, and we would hope that you have found it helpful, and will use it in future as part of your volunteer recruitment, induction and management process. If you found the tool helpful, please make your networks and colleagues in the sector aware of it.
cy: Rydych chi 'nawr wedi cwblhau'r broses Diwrnodau Cyntaf, a byddem yn gobeithio ei bod wedi bod o fudd i chi, ac y byddwch yn ei defnyddio yn y dyfodol, yn rhan o'ch prosesau ar gyfer recriwtio, ymsefydlu a rheoli gwirfoddolwyr. Os bu'r offeryn o fudd i chi, dywedwch wrth eich rhwydweithiau a'ch cyd-weithwyr yn y sector amdano.

source: You will also be shown helpful tips and links to help you in your volunteer recruitment and management process.
cy: Byddwch hefyd yn cael dolenni ac awgrymiadau defnyddiol i'ch helpu i recriwtio a rheoli gwirfoddolwyr.

source: to apply our complaints procedure if there is any problem
cy: rhoi ein gweithdrefn gŵynion ar waith, os bydd unrhyw broblem.

source: to apply our equal opportunities policy
cy: rhoi ein polisi cyfle cyfartal ar waith.

source: to consult with you and keep you informed of possible changes.
cy: ymgynghori â chi, a rhoi gwybod i chi am unrhyw newidiadau posibl.

source: to insure you against injury you suffer or cause due to negligence.
cy: eich yswirio yn erbyn unrhyw anaf y byddwch yn ei ddioddef neu yn ei achosi, o ganlyniad i esgeulustod.

source: to provide a safe environment.
cy: darparu amgylchedd diogel.

source: to provide regular meetings with your manager so that you can tell us if you are happy with how your work is organised and get feedback from us. Your manager’s name is [name of manager]
cy: darparu cyfarfodydd rheolaidd â'ch rheolwr, fel y gallwch ddweud wrthym a ydych yn fodlon ar y modd y mae eich gwaith yn cael ei drefnu, ac er mwyn i chi gael adborth gennym ni. Enw eich rheolwr yw [enw'r rheolwr].

source: to reimburse your travel and meal costs up to our current maximum.
cy: ad-dalu eich costau teithio a bwyd hyd at ein huchafswm cyfredol.

source: to respect your skills, dignity and individual wishes and to do our best to meet them.
cy: parchu eich sgiliau, eich urddas a'ch dymuniadau unigol, gan wneud ein gorau i fodloni'r rheiny.

source: Invalid email/password combination
cy: Cyfuniad annilys o gyfeiriad e-bost/cyfrinair

source: Invalid reset token
cy: Tocyn annilys ar gyfer ailosod cyfrinair

source: Password reset successfully!
cy: Y cyfrinair wedi ei ailosod yn llwyddiannus!

source: Password reset token expired
cy: Tocyn ailosod cyfrinair wedi dod i ben

source: We don't recognise that email, try again?
cy: Nid ydym yn adnabod y cyfeiriad e-bost hwnnw. Rhowch gynnig arall arni.

source: We've sent you an email with instructions on how to reset your password.
cy: Rydym wedi anfon neges e-bost atoch yn cynnwys cyfarwyddiadau ar sut i ailosod eich cyfrinair.

source: You must be logged in to access that page
cy: Rhaid i chi fewngofnodi er mwyn cael mynediad i'r dudalen honno

source: You've logged out
cy: Rydych wedi allgofnodi
