Repository: TechforgoodCAST/first-days
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: cy

source: Email
cy: E-bost

source: Forgot password?
cy: Anghofio cyfrinair?

source: Log in
cy: Mewngofnodi

source: Password
cy: Cyfrinair

source: all the First Days steps!
cy: holl gamau Diwrnodau Cyntaf!

source: 1. to provide regular meetings with your manager so that you can tell us if you are happy with how your work is organised and get feedback from us. Your manager’s name is [name of manager]
cy: 1. darparu cyfarfodydd rheolaidd â'ch rheolwr, fel y gallwch ddweud wrthym a ydych yn fodlon ar y modd y mae eich gwaith yn cael ei drefnu, ac er mwyn i chi gael adborth gennym ni. Enw eich rheolwr yw [enw'r rheolwr].

source: 2. to respect your skills, dignity and individual wishes and to do our best to meet them.
cy: 2. parchu eich sgiliau, eich urddas a'ch dymuniadau unigol, gan wneud ein gorau i fodloni'r rheiny.

source: 3. to reimburse your travel and meal costs up to our current maximum.
cy: 3. ad-dalu eich costau teithio a bwyd hyd at ein huchafswm cyfredol.

source: 4. to consult with you and keep you informed of possible changes.
cy: 4. ymgynghori â chi, a rhoi gwybod i chi am unrhyw newidiadau posibl.

source: 5. to insure you against injury you suffer or cause due to negligence.
cy: 5. eich yswirio yn erbyn unrhyw anaf y byddwch yn ei ddioddef neu yn ei achosi, o ganlyniad i esgeulustod.

source: 6. to provide a safe environment.
cy: 6. darparu amgylchedd diogel.

source: 7. to apply our equal opportunities policy
cy: 7. rhoi ein polisi cyfle cyfartal ar waith.

source: 8. to apply our complaints procedure if there is any problem
cy: 8. rhoi ein gweithdrefn gŵynion ar waith, os bydd unrhyw broblem.

source: About
cy: Gwybodaeth

source: An important part of building your volunteer relationship is in ensuring that there is a clear understanding of what is expected from each party. This is particularly important when a private sector individual is working in the third sector for the first time. It's quite common for there to be differences in working cultures that may surprise the volunteers.
cy: Rhan bwysig o feithrin eich perthynas wirfoddoli yw sicrhau bod yna ddealltwriaeth glir o ran yr hyn a ddisgwylir gan y ddwy ochr. Mae hyn yn eithriadol o bwysig pan fydd unigolyn o'r sector preifat yn gweithio yn y trydydd sector am y tro cyntaf. Mae gwahaniaethau o ran y diwylliannau gweithio yn eithaf cyffredin, a gallai hyn beri syndod i'r gwirfoddolwyr.

source: As part of the process we find it’s useful to set up a agreement between you and the organisation so that it’s clear what you can expect from us, and us from you. We’ve created an non-legal honour bound agreement below. Please read this, and if you’re happy, sign it and send it back to us by [DATE]
cy: Yn rhan o'r broses, ystyriwn ei bod yn ddefnyddiol i greu cytundeb rhyngoch chi a'r sefydliad, fel ei bod yn glir beth y gallwch ei ddisgwyl gennym ni, a ninnau gennych chithau. Rydym wedi creu cytundeb anrhydedd nad yw'n gyfreithiol isod. Darllenwch hwn, ac, os ydych yn hapus, ewch ati i'w lofnodi a'i anfon yn ôl atom erbyn [DYDDIAD].

source: Confirmation & Agreement
cy: Cadarnhad a Chytundeb

source: Confirmation & Agreement (to edit and send to the volunteer)
cy: Cadarnhad a Chytundeb (i'w olygu a'i anfon at y gwirfoddolwr)

source: Congratulations on recruiting your volunteer!
cy: Llongyfarchiadau ar lwyddo i recriwtio eich gwirfoddolwr!

source: Date:
cy: Dyddiad:

source: Dear [NAME],
cy: Annwyl [ENW],

source: First Days
cy: Diwrnodau Cyntaf

source: For the volunteer
cy: Ar gyfer y gwirfoddolwr

source: Getting them ready
cy: Eu paratoi nhw

source: I [name of volunteer], agree to do my best, to work reliably to the best of my ability, and to give as much warning as possible whenever I cannot volunteer as expected to follow [name of organisation]’s rules and procedures, including health and safety, equal opportunities and confidentially.
cy: Rwyf i, [enw'r gwirfoddolwr], yn cytuno i wneud fy ngorau, i weithio'n ddibynadwy hyd eithaf fy ngallu, ac i roi cymaint o rybudd ag sy'n bosibl pan na allaf wirfoddoli yn ôl y disgwyl, yn ogystal â dilyn rheolau a gweithdrefnau [enw'r sefydliad], gan gynnwys iechyd a diogelwch, cyfleoedd cyfartal, a chyfrinachedd.

source: I have completed this step, I am happy to say that it is done.
cy: Rwyf wedi cwblhau'r cam hwn, ac rwy'n hapus i ddweud ei fod wedi'i orffen.

source: It's good to get a signed agreement up front to help with this process.
cy: Mae'n fanteisiol cael cytundeb wedi'i lofnodi o flaen llaw, i helpu gyda'r broses hon.

source: Linked to this, if you’ve not volunteered in third sector before, you might find some differences in working culture to other sectors. To help you prepare for this, we’ve given you a few links that it may be useful for you to look at.
cy: Yn gysylltiedig â hyn, os nad ydych wedi gwirfoddoli yn y trydydd sector o'r blaen, efallai y byddwch yn canfod bod yna rai gwahaniaethau o ran y diwylliant gweithio, o gymharu â sectorau eraill. Er mwyn eich helpu i baratoi ar gyfer hynny, rydym wedi cynnwys rhai dolenni a allai fod yn ddefnyddiol i chi fwrw golwg arnynt.

source: Many Thanks
cy: Diolch yn fawr

source: Note: this agreement is in honour only and is not itended to be a legally binding contract of employment
cy: Nodwch: mae'r cytundeb hwn yn un er anrhydedd yn unig, ac nid yw wedi'i fwriadu i fod yn gytundeb cyflogaeth sy'n gyfreithiol-rwym.

source: Send to myself
cy: Anfon ataf fy hun

source: Sign up
cy: Cofrestrwch

source: Signed:
cy: Llofnodwyd:

source: The volunteer agreement template is here on the left. Please copy it into a new document so that you can edit it as you see fit, then share it with your network. You can also email it to yourself.
cy: Mae templed y cytundeb gwirfoddolwr i'w weld ar yr ochr chwith. Copïwch y templed i mewn i ddogfen newydd, fel y gallwch ei olygu yn ôl yr angen, ac yna ewch ati i'w rannu â'ch rhwydwaith. Gallwch hefyd ei anfon atoch eich hun trwy e-bost.

source: This agreement tells you what you can expect from us, and what we hope from you. We aim to be flexible, so please let us know if you would like to make any changes and we will do our best.
cy: Mae'r cytundeb hwn yn dweud wrthych beth y gallwch ei ddisgwyl gennym ni, yn ogystal â'r hyn yr ydym yn ei obeithio amdano gennych chithau. Ein nod yw bod yn hyblyg, felly rhowch wybod i ni os hoffech wneud unrhyw newidiadau, a byddwn yn gwneud ein gorau.

source: This template
cy: Mae'r templed hwn

source: Volunteers are an important and valued part of [name of organisation]. We hope that you enjoy volunteering with us and feel a full part of our team.
cy: Mae gwirfoddolwyr yn rhan bwysig a gwerthfawr o waith [enw'r sefydliad]. Rydym yn gobeithio y byddwch yn mwynhau gwirfoddoli gyda ni, ac y byddwch yn teimlo bod gennych ran lawn yn y tîm.

source: WELL DONE!
cy: DA IAWN!

source: We hope that your volunteer had a great start.
cy: Gobeithio bod eich gwirfoddolwr wedi cael dechrau da.

source: We look forward to working with you.
cy: Edrychwn ymlaen at weithio gyda chi.

source: We'd recommend you personalise and send the agreement below to the volunteer as part of the confirmation process. We've also included some links that you might want to send through to them as they may help you prepare.
cy: Byddem yn eich argymell i bersonoli'r cytundeb isod, a'i anfon at y gwirfoddolwr yn rhan o'r broses gadarnhau. Rydym hefyd wedi cynnwys rhai dolenni y mae'n bosibl y byddwch am eu hanfon at y gwirfoddolwr gan y gallent fod o gymorth wrth baratoi.

source: We're delighted that you've agreed to volunteer with us.
cy: Rydym yn falch eich bod wedi cytuno i wirfoddoli gyda ni.

source: We, [name of organisation], will do our best to introduce you to how the organisation works and your role in it and to provide any training you need. The initial training agreed is:
cy: Byddwn ni, [enw'r sefydliad], yn gwneud ein gorau i'ch cyflwyno i'r modd y mae'r sefydliad yn gweithio a beth yw eich rôl ynddo, yn ogystal â darparu unrhyw hyfforddiant y mae arnoch ei angen. Mae'r hyfforddiant cychwynnol y cytunwyd arno yn cynnwys:

source: Why should I do this?
cy: Pam y dylwn wneud hyn?

source: You can always come back and edit this template.
cy: Gallwch ei olygu unrhyw bryd.

source: You can always come back to First Days if you want to
cy: Gallwch bob amser ddychwelyd i Diwrnodau Cyntaf os

source: You have now completed
cy: Rydych 'nawr wedi cwblhau

source: [LINKS]
cy: [DOLENNI]

source: has been sent to your email.
cy: wedi cael ei anfon atoch trwy e-bost.

source: revisit the process, making it the best it can be.
cy: byddwch am ailedrych ar y broses, er mwyn sicrhau ei bod y gorau y gall fod.

source: 1) Did you enjoy your first day?
cy: 1) A wnaethoch chi fwynhau eich diwrnod cyntaf?

source: 10) Would you like to volunteer with us again?
cy: 10) A hoffech wirfoddoli gyda ni eto?

source: 11) Would you recommend our organisation to your friends and family?
cy: 11) A fyddech yn argymell ein sefydliad i'ch ffrindiau a'ch teulu?

source: 2) Did you get introduced to colleagues?
cy: 2) A gawsoch eich cyflwyno i gyd-weithwyr?

source: 3) How welcome did you feel, on a scale of 1-10 (1 being not welcome, 10 being like family)?
cy: 3) Faint o groeso a gawsoch, ar raddfa o 1-10? (1 – yn teimlo na chawsoch ddim croeso, 10 – yn teimlo'n rhan o'r teulu)

source: 4) What would have helped to make you feel more welcome?
cy: 4) Beth allai fod wedi helpu i wneud i chi deimlo'n fwy cartrefol?

source: 5) How well do you feel you understand what the organisation does and who it works with?
cy: 5) Pa mor dda, yn eich barn chi, yr ydych yn deall gwaith y sefydliad, a phwy y mae'n gweithio gyda nhw?

source: 6) What else would be useful to know?
cy: 6) Beth arall a fyddai'n ddefnyddiol i'w wybod?

source: 7) How clear do you feel about your role?
cy: 7) Pa mor eglur yr ydych yn teimlo ynghylch eich rôl?

source: 8) What would help to make you more clear about your role?
cy: 8) Beth a allai helpu i'ch gwneud yn fwy eglur ynghylch eich rôl?

source: 9) Do you have everything you need to do your role? e.g. information, equipment or resources
cy: 9) A oes gennych bopeth y mae arnoch ei angen i gyflawni eich rôl? Er enghraifft, gwybodaeth, offer neu adnoddau.

source: Bank/Building Society details (for paying expenses)
cy: Manylion Banc/Cymdeithas Adeiladu (er mwyn talu costau)

source: Before your volunteer can start, you'll likely need them to provide certain paperwork. What is needed varies for different organisations and different roles. Completing this process ahead of time is really important as it can often slow down the volunteering process and create frustrations on both sides.
cy: Cyn y gall eich gwirfoddolwr ddechrau, mae'n debyg y bydd angen iddo ddarparu gwaith papur penodol. Mae'r hyn sy'n ofynnol yn amrywio ar gyfer sefydliadau gwahanol a rolau gwahanol. Mae cwblhau'r broses hon o flaen llaw yn bwysig iawn oherwydd gall arafu'r broses wirfoddoli a chreu rhwystredigaeth, a hynny ar y naill ochr a'r llall.

source: Collect important documents
cy: Casglu dogfennau pwysig

source: Collecting Feedback
cy: Casglu adborth

source: Collecting feedback
cy: Casglu adborth

source: Congratulations on completing your first day volunteering with us!
cy: Llongyfarchiadau ar gwblhau eich diwrnod cyntaf yn gwirfoddoli gyda ni!

source: Could you please send us:
cy: Byddwch cystal ag anfon y canlynol atom:

source: DBS (Disclosure and Barring Service) check
cy: Gwiriad y DBS

source: Dear [NAME]
cy: Annwyl [ENW]

source: Document Checklist
cy: Rhestr Wirio Dogfennau

source: Edit Template
cy: Golygu'r templed

source: Email template
cy: Templed Neges e-bost

source: Emergency contact details
cy: Manylion cyswllt mewn argyfwng

source: It's helpful to get feedback from you on your first day. So we'd be grateful if you could take 5 minutes to tell us your thoughts on these questions:
cy: Mae'n ddefnyddiol cael adborth gennych am eich diwrnod cyntaf. Felly, byddem yn ddiolchgar pe gallech dreulio pum munud yn rhoi eich barn, gan ateb y cwestiynau canlynol:

source: It's important that we get better at the things we do not so well and keep doing the things that are working, so your feedback is really appreciated!
cy: Mae'n bwysig ein bod yn gwella'r pethau nad ydym cystal am eu gwneud, ac yn parhau i wneud y pethau sy'n gweithio'n dda, felly gwerthfawrogir eich adborth yn fawr!

source: It's important to get feedback from volunteers after their first day. Not only does it help you understand their experience, but also helps identify ways you can improve your induction processes. We've prepared this email that you can send out to the volunteer, which contains a link to the questions we'll ask them.
cy: Mae'n bwysig cael adborth gan wirfoddolwyr ar ôl eu diwrnod cyntaf. Nid yn unig y mae'n eich helpu i ddeall eu profiadau nhw, ond mae o gymorth hefyd i adnabod y ffyrdd y gallwch wella eich prosesau cynefino. Rydym wedi paratoi'r neges e-bost hon, y gallwch ei hanfon at y gwirfoddolwr, ac mae hefyd yn cynnwys dolen i'r cwestiynau y byddwn ninnau yn eu gofyn iddynt.

source: It's important your volunteer is prepared for their first day and has completed or sent through any paperwork they need to fill out for the role.
cy: Mae'n bwysig bod eich gwirfoddolwr yn barod ar gyfer ei ddiwrnod cyntaf, a'i fod wedi llenwi neu ddychwelyd unrhyw waith papur y mae angen iddo ei lenwi ar gyfer y rôl.

source: It’s important that we get this process underway so we’d be grateful if you could send us the documents we need by the [DATE].
cy: Mae'n bwysig ein bod yn rhoi'r broses hon ar waith, felly byddem yn ddiolchgar pe gallech anfon y dogfennau y mae arnom eu hangen erbyn [DYDDIAD].

source: Many thanks
cy: Diolch yn fawr

source: Now that your volunteer has agreed to take up the role you can begin the preparations.
cy: Nawr bod eich gwirfoddolwr wedi cytuno i ymgymryd â'r rôl, gallwch ddechrau ar y paratoadau.

source: Oops, something went wrong! Please check the errors below.
cy: Mae'n ddrwg gennym, aeth rhywbeth o'i le! Gwiriwch y gwallau isod.

source: Other
cy: Arall

source: Photo Id
cy: Llun Adnabod

source: Photo id
cy: Llun Adnabod

source: Please also let us know when you are available to start.
cy: Byddwch cystal hefyd â dweud wrthym pryd y byddwch ar gael i ddechrau.

source: Proof of address
cy: Prawf o gyfeiriad

source: Proof of identity
cy: Prawf o hunaniaeth

source: Proof of qualifications
cy: Prawf o gymwysterau

source: Proof of residency
cy: Prawf o breswyliaeth

source: Sample email with example questions
cy: Neges e-bost enghreifftiol, gyda chwestiynau enghreifftiol

source: Thanks again, and congratulations on getting the volunteer for the post!
cy: Diolch unwaith eto, a llongyfarchiadau ar gael gwirfoddolwr ar gyfer y swydd!

source: Thanks for completing the preparation checklist.
cy: Diolch am gwblhau'r rhestr wirio paratoi.

source: Thanks for using First Days to help with your succesful volunteer recruitment.
cy: Diolch am ddefnyddio Diwrnodau Cyntaf i helpu gyda'ch gwaith o recriwtio gwirfoddolwr yn llwyddiannus.

source: Thanks very much for signing up to be a volunteer. As you may expect, there is some paperwork involved in starting the position. We’ve listed what we need to receive from you below.
cy: Diolch yn fawr am gofrestru i fod yn wirfoddolwr. Fel y gallech ddisgwyl, mae yna beth gwaith papur i'w lenwi cyn dechrau'r rôl. Rydym wedi rhestru'r hyn y mae angen i ni ei gael gennych isod.

source: View Document Checklist
cy: Gweld y Rhestr Wirio Dogfennau

source: Volunteer Feedback Template
cy: Templed Adborth Gwirfoddolwr

source: Volunteer requirements e.g. dietary, medical or religious needs
cy: Anghenion y gwirfoddolwr, e.e. anghenion deietegol, meddygol neu grefyddol

source: We're grateful to you for joining the team and we hope you found your first day an enjoyable experience.
cy: Rydym yn ddiolchgar i chi am ymuno â'r tîm, ac rydym yn gobeithio y bu eich diwrnod cyntaf yn brofiad pleserus.

source: What documents or paperwork do you need from the volunteer to be able to start the role? (Please tick all that apply)
cy: Pa ddogfennau neu waith papur y mae arnoch eu hangen gan y gwirfoddolwr cyn y gall ddechrau ar ei rôl? (Ticiwch bob un sy'n berthnasol)

source: What you need to do
cy: Yr hyn y mae angen i chi ei wneud

source: When you have completed the paperwork part of the process, please log back on and we'll help you prepare a personalised email to support the volunteer on their first day.
cy: Pan fyddwch wedi llenwi'r rhan o'r broses sy'n ymwneud â gwaith papur, cofiwch ailfewngofnodi, a byddwn yn eich helpu i lunio neges e-bost personol i gefnogi'r gwirfoddolwr ar ei ddiwrnod cyntaf.

source: Write an email to your volunteer asking for their feedback - we've put some example questions in the sample email here on the left to help you. Or you might like to use a free survey tool for this, like Google Forms, Survey Monkey or TypeForm. This can make volunteers give more honest answers, as they wont' need to send it directly back to you.
cy: Ysgrifennwch ac anfonwch neges e-bost at eich gwirfoddolwr, yn gofyn am ei adborth – rydym wedi cynnwys ambell gwestiwn enghreifftiol yn y neges e-bost enghreifftiol, sydd i'w gweld ar yr ochr chwith, er mwyn eich helpu. Neu, efallai y byddwch am ddefnyddio offeryn arolygon am ddim ar gyfer hyn, e.e. Google Forms, SurveyMonkey neu TypeForm. Gall hyn annog gwirfoddolwyr i roi atebion sy'n fwy gonest, am na fydd yn rhaid iddynt eu hanfon yn ôl yn uniongyrchol atoch chi.

source: Your email text to send to the volunteer is here on the left. Please copy it into a new document so that you can edit it as you see fit, then share it with your network. You can also email it to yourself.
cy: Mae'r testun ar gyfer y neges e-bost sydd i'w hanfon at y gwirfoddolwr yma ar y chwith. Copïwch y templed i ddogfen newydd fel y gallwch ei olygu yn ôl yr angen. Yna, ewch ati i'w rannu â'ch rhwydwaith. Gallwch hefyd ei anfon atoch chi eich hun trwy e-bost.

source: First Days has been made possible with funding from The Big Lottery Fund, and is a partnership between the Wales Co-operative Centre, Wales Council for Voluntary Action (WCVA), Business in The Community (BITC) Cymru and CAST.
cy: Gwnaed Diwrnodau Cyntaf yn bosibl trwy gyllid gan y Gronfa Loteri Fawr; ac mae'n bartneriaeth rhwng Canolfan Cydweithredol Cymru, Cyngor Gweithredu Gwirfoddol Cymru, Busnes yn y Gymuned Cymru (BITC), a CAST.

source: First Days is made up of three easy to use sections. At the end of each section a template of your responses will be sent to your e-mail with the completed information, links and resources to assist you. You can then edit this template until it is exactly as you want. Once you have completed a section and you are ready to move onto the next section you can log in again at any time.
cy: Mae Diwrnodau Cyntaf yn cynnwys tair adran hawdd eu defnyddio. Ar ddiwedd pob adran, bydd templed o'ch ymatebion yn cael ei anfon i'ch cyfrif e-bost, ynghyd â'r wybodaeth a lenwyd, dolenni, ac adnoddau i'ch cynorthwyo. Gallwch olygu'r templed hwn wedyn, tan y bydd yn union fel yr ydych am iddo fod. Pan fyddwch wedi cwblhau un adran, ac yn barod i symud ymlaen at y nesaf, gallwch fewngofnodi unwaith eto, ar unrhyw adeg.

source: First days helps you to engage with volunteers from the beginning of the recruitment process right through to getting feedback on the volunteer's first day. It will help you to assess the specific volunteer needs that your organisation has and will enable you to create really focused volunteer role descriptions that will attract the necessary skills and experience to support and develop your organisation. First Days also provides you with the necessary information to keep in touch with your potential volunteers, and gives you access to a wealth of tips, resources and support.
cy: Mae Diwrnodau Cyntaf yn eich helpu i ymgysylltu â gwirfoddolwyr, a hynny o ddechrau'r broses recriwtio hyd at gael adborth am ddiwrnod cyntaf y gwirfoddolwr. Bydd yn eich helpu i asesu'r anghenion gwirfoddoli penodol sydd gan eich sefydliad, yn ogystal â'ch galluogi i lunio disgrifiadau o rolau gwirfoddoli sydd wedi'u ffocysu'n dda, ac a fydd yn denu'r sgiliau a'r profiadau angenrheidiol i gefnogi a datblygu eich sefydliad. Mae Diwrnodau Cyntaf hefyd yn darparu'r wybodaeth angenrheidiol ar eich cyfer i gadw mewn cysylltiad â gwirfoddolwyr posibl, yn ogystal â'ch cyflwyno i gyfoeth o awgrymiadau, adnoddau, a chymorth.

source: We hope that you find using First Days a simple and helpful experience and that you recommend it to your colleagues and networks in the third sector. If you have any queries please contact Geoff.jones@wales.coop. We would love to hear your feedback.
cy: Rydym yn gobeithio y bydd defnyddio Diwrnodau Cyntaf yn brofiad hawdd a defnyddiol i chi, ac y byddwch yn ei argymell i'ch cyd-weithwyr a'ch rhwydweithiau yn y trydydd sector. Os oes gennych unrhyw ymholiadau, cysylltwch â Geoff.jones@wales.coop. Byddem wrth ein bodd yn clywed eich adborth.

source: Back to Home
cy: ’Nôl i'r Hafan

source: Create description
cy: Creu disgrifiad

source: Create document list
cy: Creu rhestr o'r dogfennau

source: Create email
cy: Llunio'r neges e-bost

source: Find a volunteer
cy: Dod o hyd i wirfoddolwr

source: Finding a volunteer
cy: Dod o hyd i wirfoddolwr

source: Get them ready
cy: Eu paratoi nhw

source: Getting ready for your volunteer to start
cy: Paratoi ar gyfer eich gwirfoddolwr

source: Getting your volunteer ready to start
cy: Paratoi eich gwirfoddolwr erbyn y bydd yn dechrau

source: Log out
cy: Allgofnodi

source: Some organisations already have most of these things ready for their volunteers to start. However, if your organisation is relatively new to using volunteers then you may ﬁnd some things here useful.
cy: Mae'r rhan fwyaf o'r pethau hyn ar waith yn barod gan rai sefydliadau, a hynny cyn y bydd eu gwirfoddolwyr yn dechrau. Fodd bynnag, os yw eich sefydliad yn gymharol newydd i'r arfer o ddefnyddio gwirfoddolwyr, mae'n bosibl y bydd rhai o'r pethau hyn yn ddefnyddiol i chi.

source: Start date preparation email
cy: Neges e-bost i baratoi ar gyfer y dyddiad dechrau

source: Tips
cy: Awgrymiadau

source: View Template
cy: Gweld y templed

source: View document list
cy: Gweld y rhestr o'r dogfennau

source: View email
cy: Gweld y e-bost

source: View template
cy: Gweld y templed

source: Volunteer agreement template
cy: Templed cytundeb gwirfoddolwr

source: With the kind support of:
cy: Trwy garedigrwydd:

source: and will involve working
cy: a bydd yn cynnwys gweithio

source: to help us with
cy: er mwyn ein helpu gyda

source: volunteer is needed for
cy: ar gyfer

source: . As well as these aspects of the role, the volunteer will be able to learn about the charity’s work (and)
cy: . Yn ogystal â'r agweddau hyn ar y rôl, bydd y gwirfoddolwr yn gallu dysgu am waith yr elusen (a)

source: . Travel expenses will be paid.
cy: . Telir costau teithio.

source: A(n)
cy: Mae angen gwirfoddolwr

source: About the role
cy: Gwybodaeth am y rôl

source: April
cy: Ebrill

source: Are there any dress code requirements? (This could include dress code for the organisation, or health and safety requirements. For example footwear, wearing of jewellery, dressing for certain weather if they will be working outside)
cy: A oes yna unrhyw ofynion o ran gwisg? (Gallai hyn gynnwys cod gwisg ar gyfer y sefydliad, neu ofynion iechyd a diogelwch. Er enghraifft, esgidiau, gwisgo gemwaith, gwisgo ar gyfer tywydd penodol os bydd yn gweithio yn yr awyr agored.)

source: Are there any other details you'd like them to know ahead of time?
cy: A oes yna unrhyw fanylion eraill yr hoffech iddo eu gwybod o flaen llaw?

source: August
cy: Awst
