Repository: TechforgoodCAST/first-days
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: cy

source: Thanks for using First Days to help with your successful volunteer recruitment.
cy: Diolch am ddefnyddio Diwrnodau Cyntaf i helpu gyda'ch gwaith o recriwtio gwirfoddolwr yn llwyddiannus.

source: Done
cy: Wedi gorffen

source: Role Description Template
cy: Templed rôl-ddisgrifiad

source: Welcome to First Days!
cy: Croeso i Diwrnodau Cyntaf!

source: First Days - Document list
cy: Dyddiau Cyntaf – Rhestr Dogfennau

source: First Days - Feedback
cy: Dyddiau Cyntaf – Adborth

source: First Days - First day preparation
cy: Diwrnodau Cyntaf – Paratoi ar gyfer y diwrnod cyntaf

source: First Days - Role description
cy: Diwrnodau Cyntaf – Rôl-ddisgrifiad

source: First Days - Volunteer agreement
cy: Dyddiau Cyntaf – Cytundeb gwirfoddolwr

source: Reset password instructions
cy: Cyfarwyddiadau ar gyfer ailosod cyfrineiriau

source: Please visit
cy: Ewch i

source: to reset your password.
cy: i ailosod eich cyfrinair.
