Repository: TechforgoodCAST/first-days
Catalog: priv/gettext/*/LC_MESSAGES/errors.po
Languages: cy

source: has already been taken
cy: wedi ei ddefnyddio’n barod

source: is invalid
cy: yn annilys

source: has invalid format
cy: fformat annilys

source: has an invalid entry
cy: cofnod annilys

source: is reserved
cy: wedi ei gadw

source: should be %{count} character(s)
cy: dylai fod yn %{count} nod

source: should have %{count} item(s)
cy: dylai gael %{count} eitem

source: should be at least %{count} character(s)
cy: dylai fod yn %{count} nod o leiaf

source: should have at least %{count} item(s)
cy: dylai gael o leiaf %{count} eitem

source: should be at most %{count} character(s)
cy: dylai fod yn %{count} nod ar y mwyaf

source: should have at most %{count} item(s)
cy: dylai gael %{count} eitem ar y mwyaf

source: must be less than %{number}
cy: rhaid iddo fod yn llai na %{number}

source: must be greater than %{number}
cy: rhaid iddo fod yn fwy na %{number}

source: must be less than or equal to %{number}
cy: rhaid iddo fod yn llai na, neu yr un faint â, %{number}

source: must be greater than or equal to %{number}
cy: rhaid iddo fod yn fwy na, neu yr un faint â, %{number}

source: must be equal to %{number}
cy: rhaid iddo fod yr un faint â %{number}
